test/pimpleFSIFoam_test/pimple-pimple/topDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206+                                |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.5;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;




//###########################################################################//
MUIDomainName topDomain;
MUIInterfaceName (interface);
MUIInterfaceNumber 1;

subIterationNumber	    5;

changeSubIter        no;
changeSubIterTime    0.0;
newSubIterationNumber	1;

functions
{
    myPlane
	{
	    type            MUICoupledSurfaces;
	    libs            (sampling);
	    writeControl    timeStep;
	    writeInterval   1;
	    surfaceFormat   vtk;
	    fields          (U);

	    interpolationScheme cellPoint;
	    MUIInterfaceID 0;
        writeIterfaceSurfaceFile  false ; // output the values of the interafce to a file. in the production run it should be false
            
	    //formatOptions
	//	{
	//	    vtk
	//	    {
	//	        precision  10;
	//	    }
	//	}
        
	    MUICoupledSurfaces
	    {
		yNormal
		{
		    type        plane;
		    point       (0.0 5.0 0.0);
		    //point       (289.9 0 0);
		    normal      (0 1 0);
		    interpolate true;
		}
	    }
	}
}



// ************************************************************************* //
